In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

# https://dplyr.tidyverse.org/reference/mutate.html
from plyrda.data import starwars
from plyrda.all import *

In [2]:
starwars >> \
 select(f.name, f.mass) >> \
 mutate(
  mass2 = f.mass * 2,
  mass2_squared = f.mass2 * f.mass2
)

              name   mass  mass2  mass2_squared
0   Luke Skywalker   77.0  154.0        23716.0
1            C-3PO   75.0  150.0        22500.0
2            R2-D2   32.0   64.0         4096.0
3      Darth Vader  136.0  272.0        73984.0
4      Leia Organa   49.0   98.0         9604.0
..             ...    ...    ...            ...
82             Rey    NaN    NaN            NaN
83     Poe Dameron    NaN    NaN            NaN
84             BB8    NaN    NaN            NaN
85  Captain Phasma    NaN    NaN            NaN
86   Padmé Amidala   45.0   90.0         8100.0

[87 rows x 4 columns]

In [3]:
starwars >> \
 select(f.name, f.height, f.mass, f.homeworld) >> \
 mutate(
  mass = None,
  height = f.height * 0.0328084 # convert to feet
)

              name    height homeworld
0   Luke Skywalker  5.643045  Tatooine
1            C-3PO  5.479003  Tatooine
2            R2-D2  3.149606     Naboo
3      Darth Vader  6.627297  Tatooine
4      Leia Organa  4.921260  Alderaan
..             ...       ...       ...
82             Rey       NaN       NaN
83     Poe Dameron       NaN       NaN
84             BB8       NaN       NaN
85  Captain Phasma       NaN       NaN
86   Padmé Amidala  5.413386     Naboo

[87 rows x 3 columns]

In [4]:
x = starwars >> \
 select(f.name, f.homeworld, f.species) >> \
 mutate(across(~f.name, as_categorical))

x.dtypes
x

name         category
homeworld    category
species      category
dtype: object

              name homeworld species
0   Luke Skywalker  Tatooine   Human
1            C-3PO  Tatooine   Droid
2            R2-D2     Naboo   Droid
3      Darth Vader  Tatooine   Human
4      Leia Organa  Alderaan   Human
..             ...       ...     ...
82             Rey       NaN   Human
83     Poe Dameron       NaN   Human
84             BB8       NaN   Droid
85  Captain Phasma       NaN     NaN
86   Padmé Amidala     Naboo   Human

[87 rows x 3 columns]

In [5]:
starwars >> \
 select(f.name, f.mass, f.homeworld) >> \
 group_by(f.homeworld) >> \
 mutate(rank=min_rank(desc(f.mass))) >> \
 ungroup()

              name   mass homeworld  rank
0   Luke Skywalker   77.0  Tatooine   5.0
1            C-3PO   75.0  Tatooine   6.0
2            R2-D2   32.0     Naboo   6.0
3      Darth Vader  136.0  Tatooine   1.0
4      Leia Organa   49.0  Alderaan   2.0
..             ...    ...       ...   ...
82             Rey    NaN       NaN   NaN
83     Poe Dameron    NaN       NaN   NaN
84             BB8    NaN       NaN   NaN
85  Captain Phasma    NaN       NaN   NaN
86   Padmé Amidala   45.0     Naboo   5.0

[87 rows x 4 columns]

In [6]:
df = DataFrame(dict(x=[1], y=[2]))

df >> mutate(z=f.x+f.y)

   x  y  z
0  1  2  3

In [7]:
df >> mutate(z=f.x+f.y, _before=0) # 0-based

   z  x  y
0  3  1  2

In [8]:
df >> mutate(z=f.x+f.y, _after=f.x)

   x  z  y
0  1  3  2

In [9]:
df = DataFrame(dict(x=[1], y=[2], a=["a"], b=["b"]))
df >> mutate(z=f.x+f.y, _keep='all')

   x  y  a  b  z
0  1  2  a  b  3

In [10]:
df >> mutate(z=f.x+f.y, _keep='used')

   x  y  z
0  1  2  3

In [11]:
df >> mutate(z=f.x+f.y, _keep='unused')

   a  b  z
0  a  b  3

In [12]:
df >> mutate(z=f.x+f.y, _keep='none')

   z
0  3

In [13]:
starwars >> \
  select(f.name, f.mass, f.species) >> \
  mutate(mass_norm=f.mass/mean(f.mass, na_rm=True))

              name   mass species  mass_norm
0   Luke Skywalker   77.0   Human   0.791270
1            C-3PO   75.0   Droid   0.770718
2            R2-D2   32.0   Droid   0.328840
3      Darth Vader  136.0   Human   1.397569
4      Leia Organa   49.0   Human   0.503536
..             ...    ...     ...        ...
82             Rey    NaN   Human        NaN
83     Poe Dameron    NaN   Human        NaN
84             BB8    NaN   Droid        NaN
85  Captain Phasma    NaN     NaN        NaN
86   Padmé Amidala   45.0   Human   0.462431

[87 rows x 4 columns]

In [14]:
starwars >> \
  select(f.name, f.mass, f.species) >> \
  group_by(f.species) >> \
  mutate(mass_norm=f.mass / mean(f.mass, na_rm=True)) >> \
  ungroup()

/home/pwwang/github/plyrda/plyrda/funcs.py:484: RuntimeWarning: Mean of empty slice
  return numpy.nanmean(series) if na_rm else numpy.mean(series)

              name   mass species  mass_norm
0   Luke Skywalker   77.0   Human   0.930156
1            C-3PO   75.0   Droid   1.075269
2            R2-D2   32.0   Droid   0.458781
3      Darth Vader  136.0   Human   1.642873
4      Leia Organa   49.0   Human   0.591917
..             ...    ...     ...        ...
82             Rey    NaN   Human        NaN
83     Poe Dameron    NaN   Human        NaN
84             BB8    NaN   Droid        NaN
85  Captain Phasma    NaN     NaN        NaN
86   Padmé Amidala   45.0   Human   0.543598

[87 rows x 4 columns]

In [15]:
vars = ["mass", "height"]
starwars >> mutate(starwars, prod=f[vars[0]] * f[vars[1]])

,name,height,mass,hair_color,skin_color,eye_color,birth_year,sex,gender,homeworld,species,prod
0,Luke Skywalker,172.0,77.0,blond,fair,blue,19.0,male,masculine,Tatooine,Human,13244.0
1,C-3PO,167.0,75.0,NaN,gold,yellow,112.0,none,masculine,Tatooine,Droid,12525.0
2,R2-D2,96.0,32.0,NaN,"white, blue",red,33.0,none,masculine,Naboo,Droid,3072.0
3,Darth Vader,202.0,136.0,none,white,yellow,41.9,male,masculine,Tatooine,Human,27472.0
4,Leia Organa,150.0,49.0,brown,light,brown,19.0,female,feminine,Alderaan,Human,7350.0
...,...,...,...,...,...,...,...,...,...,...,...,...
82,Rey,NaN,NaN,brown,light,hazel,NaN,female,feminine,NaN,Human,NaN
83,Poe Dameron,NaN,NaN,brown,light,brown,NaN,male,masculine,NaN,Human,NaN
84,BB8,NaN,NaN,none,none,black,NaN,none,masculine,NaN,Droid,NaN
85,Captain Phasma,NaN,NaN,unknown,unknown,unknown,NaN,NaN,NaN,NaN,NaN,NaN
86,Padmé Amidala,165.0,45.0,brown,light,brown,46.0,female,feminine,Naboo,Human,7425.0